#### Import module

In [31]:
import pandas as pd
import numpy as np

#### Import Dataset(Table)

In [2]:
df = pd.read_excel("Walmart Sales.xlsx")

In [4]:
df

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Date,Time,Payment,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,1/5/2019,13:08:00,Ewallet,9.1
1,226-31-3081,A,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3/8/2019,10:29:00,Cash,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,3/3/2019,13:23:00,Credit card,7.4
3,123-19-1176,B,Yangon,Member,Male,Health and beauty,58.22,8,1/27/2019,20:33:00,Ewallet,8.4
4,373-73-7910,C,Yangon,Normal,Male,Sports and travel,86.31,7,2/8/2019,10:37:00,Ewallet,5.3
...,...,...,...,...,...,...,...,...,...,...,...,...
995,233-67-5758,A,Naypyitaw,Normal,Male,Health and beauty,40.35,1,1/29/2019,13:46:00,Ewallet,6.2
996,303-96-2227,A,Mandalay,Normal,Female,Home and lifestyle,97.38,10,3/2/2019,17:16:00,Ewallet,4.4
997,727-02-1313,A,Yangon,Member,Male,Food and beverages,31.84,1,2/9/2019,13:22:00,Cash,7.7
998,347-56-2442,B,Yangon,Normal,Male,Home and lifestyle,65.82,1,2/22/2019,15:33:00,Cash,4.1
999,849-09-3807,C,Yangon,Member,Female,Fashion accessories,88.34,7,2/18/2019,13:28:00,Cash,6.6

#### Analyse Datatype of each column

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Invoice ID     1000 non-null   object
 1   Branch         1000 non-null   object
 2   City           1000 non-null   object
 3   Customer type  1000 non-null   object
 4   Gender         1000 non-null   object
 5   Product line   1000 non-null   object
 6   Unit price     1000 non-null   float64
 7   Quantity       1000 non-null   int64
 8   Date           1000 non-null   datetime64[ns]
 9   Time           1000 non-null   object
 10  Payment        1000 non-null   object
 11  Rating         1000 non-null   float64
 12  Total          1000 non-null   float64
 13  YearMonth      1000 non-null   period[M]
dtypes: datetime64[ns](1), float64(3), int64(1), object(8), period[M](1)
memory usage: 109.5+ KB

#### Description of Numeric column in Dataset

In [6]:
df.describe()

        Unit price     Quantity      Rating
count  1000.000000  1000.000000  1000.00000
mean     55.672130     5.510000     6.97270
std      26.494628     2.923431     1.71858
min      10.080000     1.000000     4.00000
25%      32.875000     3.000000     5.50000
50%      55.230000     5.000000     7.00000
75%      77.935000     8.000000     8.50000
max      99.960000    10.000000    10.00000

#### Finding missing cell in columns of Dataset

In [7]:
df.isnull().sum()

Invoice ID       0
Branch           0
City             0
Customer type    0
Gender           0
Product line     0
Unit price       0
Quantity         0
Date             0
Time             0
Payment          0
Rating           0
dtype: int64

#### For finding unique City name

In [26]:
df["City"].unique()

array(['Yangon', 'Naypyitaw', 'Mandalay'], dtype=object)

## A. Performance of sales and revenue at the city and branch level

In [9]:
df['Date'] = pd.to_datetime(df['Date'])

##### Revenue = Quantity * Unit price

In [38]:
df['Revenue'] = df['Quantity'] * df['Unit price']

In [41]:
print(df[['Quantity', 'Unit price', 'Revenue']].head())

   Quantity  Unit price  Revenue
0         7       74.69   522.83
1         5       15.28    76.40
2         7       46.33   324.31
3         8       58.22   465.76
4         7       86.31   604.17

In [50]:
total_revenue = df['Revenue'].sum()
total_sales = df['Quantity'].sum()

print(f"Total Revenue: {total_revenue:,.2f}")
print(f"Total Sales: {total_sales} units")

Total Revenue: 307,587.38
Total Sales: 5510 units

#### Finding Unique Name of City

In [12]:
df['City'].unique()

array(['Yangon', 'Naypyitaw', 'Mandalay'], dtype=object)

In [51]:
grouped_data = df.groupby('City').agg(
    Total_Revenue=('Revenue', 'sum'),
    Total_Sales=('Quantity', 'sum')
).reset_index()

In [47]:
grouped_data

        City  Total_Revenue  Total_Sales
0   Mandalay      101140.64         1820
1  Naypyitaw      105303.53         1831
2     Yangon      101143.21         1859

In [52]:
grouped_data = df.groupby('Branch').agg(
    Total_Revenue=('Revenue', 'sum'),
    Total_Sales=('Quantity', 'sum')
).reset_index()

In [49]:
grouped_data

  Branch  Total_Revenue  Total_Sales
0      A      103763.00         1883
1      B      107567.19         1899
2      C       96257.19         1728

In [53]:
grouped_data = df.groupby(['City', 'Branch']).agg(
    Total_Revenue=('Revenue', 'sum'),
    Total_Sales=('Quantity', 'sum')    
).reset_index()

In [54]:
grouped_data

        City Branch  Total_Revenue  Total_Sales
0   Mandalay      A       34130.09          637
1   Mandalay      B       37215.93          664
2   Mandalay      C       29794.62          519
3  Naypyitaw      A       35985.64          648
4  Naypyitaw      B       35157.75          604
5  Naypyitaw      C       34160.14          579
6     Yangon      A       33647.27          598
7     Yangon      B       35193.51          631
8     Yangon      C       32302.43          630

#### B. What is the average price of an item sold at each branch of the city

In [15]:
average_price = df.groupby(['City', 'Branch']).agg(Average_Price=('Unit price', 'mean')).reset_index()
average_price

        City Branch  Average_Price
0   Mandalay      A      53.353866
1   Mandalay      B      56.133305
2   Mandalay      C      57.958316
3  Naypyitaw      A      54.123182
4  Naypyitaw      B      57.785688
5  Naypyitaw      C      57.941009
6     Yangon      A      55.639298
7     Yangon      B      56.011062
8     Yangon      C      52.684602

#### C. Analyze the performance of sales and revenue, Month over Month across the Product line, Gender, and Payment Method

In [16]:
df['Date'] = pd.to_datetime(df['Date'])

In [17]:
df['YearMonth'] = df['Date'].dt.to_period('M')

In [18]:
data_2019 = df[df['Date'].dt.year == 2019]

In [19]:
monthly_performance = data_2019.groupby(['YearMonth', 'Product line', 'Gender', 'Payment']).agg({'Total': 'sum'}).reset_index()

In [20]:
monthly_performance.sort_values(by=['YearMonth'], inplace=True)

In [21]:
print("Monthly Sales Performance Across Product Line, Gender, and Payment :")
monthly_performance

Monthly Sales Performance Across Product Line, Gender, and Payment :

    YearMonth            Product line  Gender      Payment    Total
0     2019-01  Electronic accessories  Female         Cash  2731.86
20    2019-01       Health and beauty  Female      Ewallet  2471.17
21    2019-01       Health and beauty    Male         Cash  3732.94
22    2019-01       Health and beauty    Male  Credit card  3712.44
23    2019-01       Health and beauty    Male      Ewallet  3033.80
..        ...                     ...     ...          ...      ...
84    2019-03      Food and beverages  Female         Cash  3601.07
85    2019-03      Food and beverages  Female  Credit card  2566.32
86    2019-03      Food and beverages  Female      Ewallet  3230.27
88    2019-03      Food and beverages    Male  Credit card  1611.44
107   2019-03       Sports and travel    Male      Ewallet  4930.61

[108 rows x 5 columns]

In [22]:
march_performance = monthly_performance[monthly_performance['YearMonth'] == '2019-03']
low_areas = march_performance[march_performance['Total'] < march_performance['Total'].quantile(0.25)]

In [23]:
print("\nFocus Areas to Improve Sales for April 2019:")
low_areas

Focus Areas to Improve Sales for April 2019:

    YearMonth            Product line  Gender      Payment    Total
91    2019-03       Health and beauty  Female  Credit card  1767.17
92    2019-03       Health and beauty  Female      Ewallet  1874.93
102   2019-03       Sports and travel  Female         Cash  1799.53
90    2019-03       Health and beauty  Female         Cash  1555.04
87    2019-03      Food and beverages    Male         Cash  1779.42
76    2019-03  Electronic accessories    Male  Credit card   658.81
78    2019-03     Fashion accessories  Female         Cash  1445.19
82    2019-03     Fashion accessories    Male  Credit card  1631.35
88    2019-03      Food and beverages    Male  Credit card  1611.44